Documents/УтверждениеГрафикаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УтверждениеГрафикаРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикРаботы</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УтверждениеГрафикаРабот/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    

    ТекущаяДата = НачалоГода(Дата);
    ДатаКонца = КонецГода(Дата);
    Движения.ГрафикРаботы.Записывать = Истина;
    
    Пока ТекущаяДата <= ДатаКонца Цикл 
        
        Движение =  Движения.ГрафикРаботы.Добавить();
        Движение.Дата = ТекущаяДата;

        Если   ДеньНедели(ТекущаяДата) <= 6 Тогда
            Движение.РабочийДень = 1;
        Иначе
            Движение.РабочийДень = 0;
        КонецЕсли; 
        ТекущаяДата = ТекущаяДата + 86400;
    КонецЦикла;
    
КонецПроцедуры
